In [3]:
import numpy as np
import pandas as pd

In [5]:
test = pd.read_csv("../kaggle-data/train.csv")

In [6]:
x = test.sample(frac=.25)

In [8]:
test.shape

(20216100, 4)

In [9]:
x.shape

(5054025, 4)

In [53]:
building_list = test['building_id'].unique()
len(building_list)

1449

In [54]:
building_list = pd.DataFrame({"building_id" : test['building_id'].unique()}).sample(frac=0.25)

In [55]:
building_list

     building_id
899          921
745          762
279          281
21            21
241          243
..           ...
785          805
439          444
945          967
604          618
402          407

[362 rows x 1 columns]

In [56]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20216100 entries, 0 to 20216099
Data columns (total 4 columns):
 #   Column         Dtype
---  ------         -----
 0   building_id    int64
 1   meter          int64
 2   timestamp      object
 3   meter_reading  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 616.9+ MB

In [58]:
df = test[test.building_id.isin(building_list.building_id)]
df

          building_id  meter            timestamp  meter_reading
1                   1      0  2016-01-01 00:00:00          0.000
4                   4      0  2016-01-01 00:00:00          0.000
12                 12      0  2016-01-01 00:00:00          0.000
16                 16      0  2016-01-01 00:00:00          0.000
18                 18      0  2016-01-01 00:00:00          0.000
...               ...    ...                  ...            ...
20216069         1426      2  2016-12-31 23:00:00        262.582
20216072         1428      0  2016-12-31 23:00:00         38.725
20216087         1438      0  2016-12-31 23:00:00        100.675
20216088         1438      2  2016-12-31 23:00:00        852.770
20216096         1445      0  2016-12-31 23:00:00          4.825

[5087340 rows x 4 columns]